In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# Load the dataset
df = pd.read_csv('ds_salaries.csv')

## Data preprocessing ##

In [3]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [6]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

In [10]:
# Check if data is null
df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [12]:
# Check for duplication
df.duplicated().sum()

1171

In [13]:
# Eraser duplication
df.drop_duplicates(inplace=True)

In [18]:
df.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
work_year,2584.0,NaN,NaN,NaN,2022.301084,0.749179,2020.0,2022.0,2022.0,2023.0,2023.0
experience_level,2584,4,SE,1554,NaN,NaN,NaN,NaN,NaN,NaN,NaN
employment_type,2584,4,FT,2547,NaN,NaN,NaN,NaN,NaN,NaN,NaN
job_title,2584,93,Data Engineer,598,NaN,NaN,NaN,NaN,NaN,NaN,NaN
salary,2584.0,NaN,NaN,NaN,210365.29644,808037.535609,6000.0,90000.0,134630.0,182562.5,30400000.0
salary_currency,2584,20,USD,2107,NaN,NaN,NaN,NaN,NaN,NaN,NaN
salary_in_usd,2584.0,NaN,NaN,NaN,133409.280186,67136.837329,5132.0,84975.0,130000.0,175000.0,450000.0
employee_residence,2584,78,US,1893,NaN,NaN,NaN,NaN,NaN,NaN,NaN
remote_ratio,2584.0,NaN,NaN,NaN,50.483746,48.163707,0.0,0.0,50.0,100.0,100.0
company_location,2584,72,US,1929,NaN,NaN,NaN,NaN,NaN,NaN,NaN
company_size,2584,3,M,2028,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [19]:
# Size of dataset
df.shape

(2584, 11)

## Question ##

### Thành Đức

Question 1:

Question 2:

## Bá Đức ##

Question 1:

Question 2:

### Bá Duy ###

Question 1:

Question 2:

### Duy Lân ###

Question 1:

Question 2: